OpenFOAM/thermofluid/tutorials/deprecatedTutorials/bubbleRiseIsoCase1/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

MetalProperties
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 0.01;
    rhoS              1000;
    rhoL              1000;
}

GasProperties
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 0.01;
    rhoG            100;

}


sigma           sigma [ 1 0 -2 0 0 0 0 ] 24.5;
STgrad		STgrad [1 0 -2 -1 0 0 0] 0; //small value as ST is assumed the same everywhere

// ************************************************************************* //
